Chromatique-backend/app/controllers/levels_controller.rb

  def get_level
    @level = Level.find(params[:id])
---
SELECT  "levels".* FROM "levels" WHERE "levels"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]